doom/conf.el
(setq user-full-name "Liam Chung"
      user-mail-address "lwalkerchung@gmail.com")

(defun a-very-pretty-flower ()
  (let* ((banner '("                              ....                                  "
                   "                           ,;;\'\'\'\';;,                    ,;;;;,     "
                   "                 ,        ;;\'      `;;,               .,;;;\'   ;    "
                   "              ,;;;       ;;          `;;,\';;;,.     ,%;;\'     \'     "
                   "            ,;;,;;       ;;         ,;`;;;, `;::.  %%;\'             "
                   "           ;;;,;;;       `\'       ,;;; ;;,;;, `::,%%;\'              "
                   "           ;;;,;;;,          .,%%%%%\'% ;;;;,;;   %;;;               "
                   " ,%,.      `;;;,;;;,    .,%%%%%%%%%\'%; ;;;;;,;;  %;;;               "
                   ";,`%%%%%%%%%%`;;,;;\'%%%%%%%%%%%%%\'%%\'  `;;;;;,;, %;;;               "
                   ";;;,`%%%%%%%%%%%,; ..`%%%%%%%%;\'%%%\'    `;;;;,;; %%;;               "
                   " `;;;;;,`%%%%%,;;/, .. `\"\"\"\'\',%%%%%      `;;;;;; %%;;,              "
                   "    `;;;;;;;,;;/////,.    ,;%%%%%%%        `;;;;,`%%;;              "
                   "           ;;;/%%%%,%///;;;\';%%%%%%,          `;;;%%;;,             "
                   "          ;;;/%%%,%%%%%/;;;\';;\'%%%%%,             `%%;;             "
                   "         .;;/%%,%%%%%//;;\'  ;;;\'%%%%%,             %%;;,            "
                   "         ;;//%,%%%%//;;;\'   `;;;;\'%%%%             `%;;;            "
                   "         ;;//%,%//;;;;\'      `;;;;\'%%%              %;;;,           "
                   "         `;;//,/;;;\'          `;;;\'%%\'              `%;;;           "
                   "           `;;;;\'               `;\'%\'                `;;;;          "
                   "                                  \'      .,,,.        `;;;;         "
                   "                                      ,;;;;;;;;;;,     `;;;;        "
                   "                                     ;;;\'    ;;;,;;,    `;;;;       "
                   "                                     ;;;      ;;;;,;;.   `;;;;      "
                   "                                      `;;      ;;;;;,;;   ;;;;      "
                   "                                        `\'      `;;;;,;;  ;;;;      "
                   "                                                   `;;,;, ;;;;      "
                   "                                                      ;;, ;;;;      "
                   "                                                        \';;;;;      "
                   "                                                         ;;;;;      "
                   "                                                        .;;;;\'      "
                   "                                                       .;;;;\'       "
                   "                                                      ;;;;;\'        "
                   "                                                    ,;;;;\'          "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

; (setq +doom-dashboard-ascii-banner-fn #'doom-dashboard-draw-ascii-emacs-banner-fn)
(setq +doom-dashboard-ascii-banner-fn #'a-very-pretty-flower)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-footer)
(setq-hook! '+doom-dashboard-mode-hook cursor-type nil)
(setq-hook! '+doom-dashboard-mode-hook evil-normal-state-cursor nil)

;;alternatives: doom-dracula, doom-one, doom-solarized-dark, doom-palenight
;(setq doom-theme 'doom-nord)
;(setq doom-theme 'doom-nano-dark)
(setq doom-theme 'doom-palenight)
(setq projectile-project-search-path '("~/documents" ) ;; default project dir
      line-move-visual nil ;; no visual line mode, ie moving across wrapped lines are separate
      display-line-numbers-type t ;; line numbers: nil for none, relative, or t for reg
      ;doom-font (font-spec :family "JetBrains Mono" :size 22)
      ;doom-font (font-spec :family "Roboto Mono" :size 22)
      doom-font (font-spec :family "FiraCode Nerd Font" :size 16 :weight 'regular)
      confirm-kill-emacs nil) ;; do not ask if i want to exit

;; i think it should work better now since i put snippets back in packages.el?
;;(setq doom-snippets-dir "~/.doom.d/snippets/")
;;(setq +file-templates-dir "~/.doom.d/snippets/")
(set-file-template! "\\.tex$" :trigger "latex-default")
;;(yas-reload-all)

;; when opening file, read number of lines and add width to line number column
(defun display-line-numbers-equalize ()
  (setq display-line-numbers-width (length (number-to-string (line-number-at-pos (point-max))))))
(add-hook 'find-file-hook 'display-line-numbers-equalize)

;; Hide the tabs since I don't want to click on them
(setq tab-bar-show nil
      desktop-save-mode t)

(require 'web-mode)
(require 'pdf-tools)
(add-to-list 'auto-mode-alist '("\\.html\;" . web-mode))
(add-to-list 'auto-mode-alist '("\\.php\;" . web-mode))
(add-to-list 'auto-mode-alist '("\\.js\;" . js-mode))
;(add-to-list 'auto-mode-alist '("\\.fish\;" . fish-mode))
(add-to-list 'auto-mode-alist '("\\.pdf\;" . pdf-tools))

(use-package! kbd-mode)
(add-to-list 'auto-mode-alist '("\\.kbd\;" . kbd-mode))

; (use-package lambda-line
;   :custom
;   (lambda-line-icon-time nil) ;; requires ClockFace font (see below)
;   (lambda-line-position 'top) ;; Set position of status-line
;   (lambda-line-abbrev t) ;; abbreviate major modes
;   (lambda-line-hspace " ")  ;; add some cushion
;   (lambda-line-prefix t) ;; use a prefix symbol
;   (lambda-line-prefix-padding nil) ;; no extra space for prefix
;   (lambda-line-status-invert nil)  ;; no invert colors
;   (lambda-line-gui-ro-symbol  " ◉") ;; symbols
;   (lambda-line-gui-mod-symbol " ●")
;   (lambda-line-gui-rw-symbol  " ○")
;   (lambda-line-space-top +.60)  ;; padding on top and bottom of line
;   (lambda-line-space-bottom -.60)
;   (lambda-line-symbol-position 0) ;; adjust the vertical placement of symbol
;   :config
;   ;; activate lambda-line
;   (lambda-line-mode)
;   ;; set divider line in footer
;   (when (eq lambda-line-position 'top)
;     (setq-default mode-line-format (list "%_"))
;     (setq mode-line-format (list "%_"))))

(map! :leader
      (:prefix ("TAB" . "workspace")
        :desc "load workspace"              "SPC" #'+workspace/load
        :desc "workspace forward"             "l" #'+workspace/switch-right
        :desc "workspace back"                "h" #'+workspace/switch-left))

(map! :leader
      (:prefix ("b" . "buffer")
        :desc "Kill buffer and window"        "k" #'kill-buffer-and-window))

(map! :leader
      (:prefix ("d" . "dired")
