doom/conf.el
  (setq org-directory "~/documents/org"
        ;; todo vars
        org-todo-keywords '((sequence "TODO(t)" "|" "WAIT(w)" "DONE(d)" ))
        ;;org-todo-keyword-faces '(("TODO" . "magenta"))
        org-use-fast-todo-selection 'expert
        ;; agenda vars
        org-agenda-skip-scheduled-if-done t
        org-agenda-files (list "~/documents/org/gtd/")
        ;; startup vars
        org-startup-folded t
        org-startup-indented t
        ;; org-startup-with-inline-images t
        ;; fontifying
        org-fontify-done-headline t
        org-fontify-whole-heading-line t
        org-fontify-quote-and-verse-blocks t
        org-src-fontify-natively t
        ;; other
        org-cycle-include-plain-lists 'integrate ; plain lists start folded
        org-tags-column -60
        org-ellipsis "  " ;; folding symbol
        org-agenda-block-separator ""
        org-list-allow-alphabetical t   ; have a. A. a) A) list bullets
        org-fold-catch-invisible-edits 'smart ; don't brazenly edit things you can't see

        org-refile-targets '(("~/documents/org/gtd/gtd.org" :maxlevel . 2)
                           ("~/documents/org/gtd/someday.org" :level . 2))
        ))
        ;;prot/scroll-center-cursor-mode t))

(remove-hook 'org-mode-hook #'auto-fill-mode)

(add-hook! org-mode :append
           #'visual-line-mode
           #'org-appear-mode
           #'olivetti-mode
           #'org-superstar-mode
           #'prettify-symbols-mode
           ;#'org-modern
           #'org-toggle-pretty-entities
           ;#'variable-pitch-mode
)
(setq-hook! org-mode line-spacing .1)

(custom-set-faces!
  '(org-todo          :family "FiraCode Nerd Font")
  '(org-done          :family "FiraCode Nerd Font" :strike-through t)
  '(org-headline-done :strike-through t))

;(custom-set-faces!
 ;'(outline-8          :family "ETBembo" :weight bold)
 ;'(outline-7          :family "ETBembo" :weight bold)
 ;'(outline-6          :family "ETBembo" :weight bold)
 ;'(outline-5          :family "ETBembo" :weight bold)
 ;'(outline-4          :family "ETBembo" :weight bold :height 1.2)
 ;'(outline-3          :family "ETBembo" :weight bold :height 1.4)
 ;'(outline-2          :family "ETBembo" :weight bold :height 1.6)
 ;'(outline-1          :family "ETBembo" :weight bold :height 1.8)
 ;'(org-document-title :family "ETBembo" :weight bold :height 2.5 :underline nil)
 ;'(variable-pitch     :family "ETBembo" :height 150 :weight book)
 ;'(org-hide           :family "FiraCode Nerd Font" :height 0.8)

 ;'(outline-4          :family "FiraCode Nerd Font" :weight bold :height 1.1)
 ;'(outline-3          :family "FiraCode Nerd Font" :weight bold :height 1.4)
 ;'(outline-2          :family "FiraCode Nerd Font" :weight bold :height 1.5)
 ;'(outline-1          :family "FiraCode Nerd Font" :weight bold :height 1.6)
 ;'(org-document-title :family "FiraCode Nerd Font" :weight bold :height 2.2 :underline nil)
 ;'(org-document-info-keyword :foreground "#676E95", :extend nil
 ;                     :family "FiraCode Nerd Font" :height 200 :weight regular)
 ;'(org-meta-line      :foreground "#676E95", :extend nil
 ;                     :family "FiraCode Nerd Font" :height 100 :weight regular)
 ;'(org-superstar-leading-bullet :family "FiraCode Nerd Font")
 ;'(org-checkbox-statistics-todo :height 1.1)
 ;'(org-latex-and-related :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 ;'(org-date :family "FiraCode Nerd Font" :weight normal :foreground "#82aaff")
 ;'(org-table :family "FiraCode Nerd Font")
 ;'(org-special-keyword :family "FiraCode Nerd Font" :weight normal :height 0.75 )
 ;'(fixed-pitch        :family "FiraCode Nerd Font"   :height 100))

(custom-set-faces!
 '(org-document-info-keyword :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-meta-line      :foreground "#676E95", :extend nil
                      :family "FiraCode Nerd Font" :weight regular)
 '(org-superstar-leading-bullet :family "FiraCode Nerd Font")
 '(org-latex-and-related :weight normal :foreground "#82aaff")
 '(org-date :weight normal :foreground "#82aaff")
 '(org-special-keyword :weight normal :height 0.75 ))

(custom-set-faces!
  '(org-block-begin-line  :background "#292D3E", :foreground nil, :extend nil
                          :family "FiraCode Nerd Font" :weight regular)
  '(org-block             :foreground unspecified, :extend nil
                          :family "FiraCode Nerd Font" :weight regular)
  '(org-block-end-line    :background "#292D3E", :foreground nil, :extend nil
                          :family "FiraCode Nerd Font" :weight regular))

(add-hook 'org-mode-hook (lambda ()
  (display-line-numbers-mode -1)
  (setq left-margin-width 2)
  (setq right-margin-width 2)
  (vi-tilde-fringe-mode -1)))

(use-package! olivetti
  :after org olivetti
  :config
    ;(setq olivetti-min-body-width 110
    (setq olivetti-body-width 100
          olivetti-style 'fancy ; fantastic new layout
          olivetti-margin-width 6))

(custom-set-faces! '(fringe :background "#272B3A"))
