doom/conf.org
** Config
Basic config
#+begin_src emacs-lisp
;;(setq +latex-viewers '(pdf-tools))
;; (setq TeX-view-program-list '(("Sioyek" "sioyek %o")))
;; (setq TeX-view-program-selection '((output-pdf "Sioyek")))
(setq +latex-viewers '(sioyek))

(setq TeX-view-program-list
        ;; '(("Sioyek" ("sioyek %o --reuse-instance"
        '(("Sioyek" ("sioyek %o"
        (mode-io-correlate " --forward-search-file %b --forward-search-line %n --inverse-search \"emacsclient --no-wait +%2:%3 %1\"")) "sioyek"))
      TeX-view-program-selection
        '(((output-dvi has-no-display-manager) "dvi2tty")
          ((output-dvi style-pstricks)  "dvips and gv")
          (output-dvi "xdvi")
          (output-pdf "Sioyek")
          (output-html "xdg-open")))

;; latex config
(use-package tex
  :defer t
  :ensure auctex
  :config
  (setq tex-auto-save t)
  (setq tex-parse-self t)
 ; (setq tex-fontify-script nil)
 ; (setq font-latex-fontify-script nil)
  ;; don't insert {} automatically for sub and superscripts
  (setq TeX-electric-sub-and-superscript nil)
  (setq-default tex-master nil))

#+end_src
Adding environments
#+begin_src emacs-lisp
(add-hook 'LaTeX-mode-hook
      (lambda ()
        (LaTeX-add-environments "align")
        (LaTeX-add-environments "prooftree")
        (LaTeX-add-environments "problem")
        (LaTeX-add-environments "proof")
        (LaTeX-add-environments "align*")))
#+end_src
Prettifying symbols and its behaviour
#+begin_src emacs-lisp
;(add-hook 'LaTeX-mode-hook #'prettify-symbols-mode)
;(setq prettify-symbols-unprettify-at-point t)
;(setq prettify-symbols-unprettify-at-point nil)
#+end_src
** Hooks
Enable tex folding in all LaTeX docs
#+begin_src emacs-lisp
(add-hook 'LaTeX-mode-hook (lambda ()
                             (cdlatex-mode 0)
                             (outline-minor-mode 1) ))
                             ; (TeX-fold-mode 0) ))
                             ;(latex-preview-pane-mode 1)
                             ;(TeX-fold-buffer)))
#+end_src
** Keybinds
#+begin_src emacs-lisp
(map! (:after latex
       :map LaTeX-mode-map
        :localleader
        :desc "run all commands"      "a" #'TeX-command-run-all
        :desc "env menu"              "e" #'LaTeX-environment
        :desc "view errors"           "q" #'TeX-next-error
        :desc "close block"           "C" #'LaTeX-close-block
        :desc "open preview pane"     "c" #'latex-preview-pane-mode
        :desc "open preview pane"     "p" #'helloworld
        :desc "sect menu"             "s" #'LaTeX-section
        (:prefix ("f" . "font")
                :desc "bold"            "b" #'(lambda () (interactive) (TeX-font nil 2))
                :desc "ital"            "i" #'(lambda () (interactive) (TeX-font nil 9))
                :desc "emph"            "e" #'(lambda () (interactive) (TeX-font nil 5))
                :desc "slant"           "s" #'(lambda () (interactive) (TeX-font nil 19))
                :desc "roman"           "r" #'(lambda () (interactive) (TeX-font nil 18))
                :desc "sans"            "f" #'(lambda () (interactive) (TeX-font nil 6))
                :desc "typewr"          "t" #'(lambda () (interactive) (TeX-font nil 20))
                :desc "smlcaps"         "c" #'(lambda () (interactive) (TeX-font nil 3))
                :desc "delete font"     "d" #'(lambda () (interactive) (TeX-font nil 4)))))

  ;;     :desc "ctrl + enter" "C-RET" #'LaTeX-insert-item
#+end_src
** CDLatex
#+begin_src emacs-lisp
;; (setq cdlatex-use-dollar-to-ensure-math t)
#+end_src
** Snippets
#+begin_src emacs-lisp
(defun my/yas-try-expanding-auto-snippets ()
  (when (bound-and-true-p 'yas-minor-mode)
      (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
        (yas-expand))))

;; Try after every insertion
;(add-hook 'post-self-insert-hook #'my/yas-try-expanding-auto-snippets)

(with-eval-after-load 'warnings
  (cl-pushnew '(yasnippet backquote-change) warning-suppress-types
              :test 'equal))
#+end_src
** Auto activating snippets
#+begin_src emacs-lisp
(use-package aas
  :hook (LaTeX-mode . aas-activate-for-major-mode)
  :hook (org-mode . aas-activate-for-major-mode)
  :config
  (aas-set-snippets 'text-mode
    ;; expand unconditionally
    ";o-" "ō"
    ";i-" "ī"
    ";a-" "ā"
    ";u-" "ū"
    ";e-" "ē")
  (aas-set-snippets 'latex-mode
    ;; set condition!
    :cond #'texmathp ; expand only while in math
    "supp" "\\supp"
    "On" "O(n)"
    "O1" "O(1)"
    ;; Use YAS/Tempel snippets with ease!
    ";ig" #'insert-register
    ";call-sin"
    (lambda (angle) ; Get as fancy as you like
      (interactive "sAngle: ")
      (insert (format "%s" (sin (string-to-number angle))))))
  ;; disable snippets by redefining them with a nil expansion
  (aas-set-snippets 'latex-mode
    "mk"   '(yas "\$$1\$$0") ; YASnippet snippet shorthand form
    "supp" nil))

(add-to-list 'load-path "~/.config/doom")
(require 'laas)
#+end_src
* PDF
** Hooks for pdf viewing                            :CLEAN:
#+begin_src emacs-lisp
(add-hook 'pdf-outline-buffer-mode-hook #'pdf-outline-hook)
(add-hook 'pdf-view-mode-hook 'pdf-view-midnight-minor-mode)

(defun pdf-outline-hook ()
  (display-line-numbers-mode -1) ;; don't display line numbers
  (setq left-margin-width 2)     ;;
  (outline-hide-sublevels 1))

#+end_src
open pdfs scaled to fit page
#+begin_src emacs-lisp
(after! pdf-tools
  (setq-default pdf-view-display-size 'fit-page))
#+end_src
automatically annotate highlights
#+begin_src emacs-lisp
(after! pdf-tools
  (setq pdf-annot-activate-created-annotations t))

(setq pdf-view-use-scaling t)
(setq pdf-view-midnight-invert nil)
#+end_src
** keymap                                           :CLEAN:
#+begin_src emacs-lisp
(map! :after pdf-tools
      :map pdf-isearch-active-mode-map
      [return]  'isearch-repeat-forward
      "ESC"     'isearch-cancel
      )

 (custom-set-faces!
   '(pdf-isearch-match :background "MediumSeaGreen"))

#+end_src
** centering on zooming
want to recenter the document when zooming in or out.
The relevant functions are:
- ~pdf-view-shrink~
- ~pdf-view-enlarge~
#+begin_src emacs-lisp
(defun pdf-zoom-in ()
  (pdf-view-shrink)
  (pdf-view-center-in-window))

(defun pdf-zoom-out ()
  (pdf-view-enlarge)
  (pdf-view-center-in-window))
#+end_src
** smooth scroll                                    :CLEAN:
** continuous scroll                                :CLEAN:
* EMMS
** Initialization                                   :CLEAN:
#+begin_src emacs-lisp
(emms-all)
(emms-history-load)
(emms-default-players)
#+end_src
Other config pieces pulled from elsewhere; do I want/need them?
#+begin_src emacs-lisp
;(require 'emms-source-file nil t)
;(require 'emms-source-playlist nil t)
(when (require 'emms-player-mpv nil t)
    (add-to-list 'emms-player-mpv-parameters
            (setq emms-player-mpv-input-file (expand-file-name "emms-mpv-input-file" emms-directory))
            (setq emms-player-list '(emms-player-mpv))))
#+end_src
** Config
#+begin_src emacs-lisp
(define-emms-simple-player mpv '(file url)
(regexp-opt '(".mp3" ".wav" ".mov" ".avi" ".mkv" ".mp4" ".flac" ".m4a" ))
"mpv" "--quiet" "--no-audio-display" "--no-terminal" "--shuffle" "yes")

(setq emms-source-file-default-directory (expand-file-name "~/media/music/")
      emms-browser-default-browse-type 'info-album
      emms-info-functions '(emms-info-exiftool)
      emms-browser-covers 'emms-browser-cache-thumbnail-async
      emms-playlist-buffer-name "*Music*")

(emms-browser-make-filter "all" 'ignore)
#+end_src
** Browser Info Format
Format strings govern the way items are displayed in the browser and playlist. You can customize these if you wish.
*** Documentation
Insert 'info-title' / 'info-artist' / 'info-album' into:
emms-browser-<type>-format
emms-browser-playlist-<type>-format

The format specifiers available include:
- %i indent relative to the current level
- %n the value of the item - eg -info-artist might be "pink floyd”
- %y the album year
- %A the album name
- %a the artist name of the track
- %t the title of the track
- %T the track number
- %cS a small album cover
- %cM a medium album cover
- %cL a big album cover

Note that if you use track-related items like %t, it will take the data from the first track.

The faces used to display the various fields are also customizable. They are in the format emms-browser-<type>-face, where type is one of "year/genre", "artist", "album" or "track". Note that faces lack the initial "info-" part. For example, to change the artist face, type M-x customize-face emms-browser-artist-face.
*** Config
In the browser buffer:
#+begin_src emacs-lisp
(setq emms-browser-info-title-format "%i%T. %t")
(setq emms-browser-info-album-format "%i%cS %n")
#+end_src
In the music buffer:
#+begin_src emacs-lisp
(setq emms-browser-playlist-info-title-format "%i%T. %t")
(setq emms-browser-playlist-info-album-format "%i%cM")
#+end_src
** Keybinds
Press tab to collapse/expand current item
#+begin_src emacs-lisp
(map! :map emms-browser-mode-map :n "<backtab>" #'emms-browser-toggle-subitems
                                 :n "<tab>"     #'emms-browser-toggle-subitems)
#+end_src
*** browser
