doom/conf.org
**** evil
- keep
 <normal-state> +           emms-volume-raise
 <normal-state> -           emms-volume-lower
 <normal-state> /           emms-isearch-buffer
 <normal-state> <backtab>   emms-browser-toggle-subitems
 <normal-state> <tab>       emms-browser-toggle-subitems
 <normal-state> C           emms-browser-clear-playlist
 <normal-state> C-<return>  emms-browser-add-tracks-and-play
 <normal-state> C-j         emms-browser-next-non-track
 <normal-state> C-k         emms-browser-prev-non-track
 <normal-state> RET         emms-browser-add-tracks
- remove
- ???
 <normal-state> <           emms-seek-backward
 <normal-state> =           emms-volume-raise
 <normal-state> >           emms-seek-forward
<normal-state> D           emms-browser-delete-files
<normal-state> N           isearch-repeat-backward
<normal-state> X           emms-stop
<normal-state> [ [         emms-browser-prev-non-track
<normal-state> ] ]         emms-browser-next-non-track
<normal-state> ^           emms-browser-move-up-level
<normal-state> d           emms-browser-view-in-dired
<normal-state> g 0         emms-browser-expand-all
<normal-state> g 1         emms-browser-collapse-all
<normal-state> g 2         emms-browser-expand-to-level-2
<normal-state> g 3         emms-browser-expand-to-level-3
<normal-state> g 4         emms-browser-expand-to-level-4
<normal-state> g A         emms-browse-by-album
<normal-state> g C w       emms-browser-lookup-composer-on-wikipedia
<normal-state> g P w       emms-browser-lookup-performer-on-wikipedia
<normal-state> g a         emms-browse-by-artist
<normal-state> g b         emms-browse-by-genre
<normal-state> g c         emms-browse-by-composer
<normal-state> g d         emms-browser-view-in-dired
<normal-state> g j         emms-browser-next-non-track
<normal-state> g k         emms-browser-prev-non-track
<normal-state> g p         emms-browse-by-performer
<normal-state> g y         emms-browse-by-year
<normal-state> n           isearch-repeat-forward
<normal-state> r           emms-random
<normal-state> s A         emms-browser-search-by-album
<normal-state> s a         emms-browser-search-by-artist
<normal-state> s c         emms-browser-search-by-composer
<normal-state> s p         emms-browser-search-by-performer
<normal-state> s s         emms-browser-search-by-names
<normal-state> s t         emms-browser-search-by-title
<normal-state> u           emms-playlist-mode-undo
<normal-state> x           emms-pause
<normal-state> z c         emms-browser-collapse-all
<normal-state> z m         emms-browser-collapse-all
<normal-state> z o         emms-browser-expand-one-level
<normal-state> z r         emms-browser-expand-all
**** not evil
- already have
 W d                        emms-browser-view-in-dired
 ~+~                          emms-volume-raise
 ~-~                          emms-volume-lower
 C                          emms-browser-clear-playlist
 RET                        emms-browser-add-tracks
 C-RET                      emms-browser-add-tracks-and-play
 d                          emms-browser-view-in-dired
 /                          emms-isearch-buffer
- add in
 D                          emms-browser-delete-files
 q                          emms-browser-bury-buffer
 b 1                        emms-browse-by-artist
 b 2                        emms-browse-by-album
 b 3                        emms-browse-by-genre
 b 4                        emms-browse-by-year
 b 5                        emms-browse-by-composer
 b 6                        emms-browse-by-performer
 s A                        emms-browser-search-by-album
 s a                        emms-browser-search-by-artist
 s c                        emms-browser-search-by-composer
 s p                        emms-browser-search-by-performer
 s s                        emms-browser-search-by-names
 s t                        emms-browser-search-by-title
- ???
 1                          emms-browser-collapse-all
 2                          emms-browser-expand-to-level-2
 3                          emms-browser-expand-to-level-3
 4                          emms-browser-expand-to-level-4
 <                          emms-browser-previous-filter
 >                          emms-browser-next-filter
 <backtab>                  emms-browser-prev-non-track
 C-/                        emms-playlist-mode-undo
 E                          emms-browser-expand-all
- expand/collapse
 W 0                        emms-browser-expand-all
 W 1                        emms-browser-collapse-all
 W 2                        emms-browser-expand-to-level-2
 W 3                        emms-browser-expand-to-level-3
 W 4                        emms-browser-expand-to-level-4
- browse by
 W A                        emms-browse-by-album
 W a                        emms-browse-by-artist
 W b                        emms-browse-by-genre
 W c                        emms-browse-by-composer
 W p                        emms-browse-by-performer
 W y                        emms-browse-by-year
- look up
 W C w                      emms-browser-lookup-composer-on-wikipedia
 W P w                      emms-browser-lookup-performer-on-wikipedia
W j                        emms-browser-next-non-track
W k                        emms-browser-prev-non-track
^                          emms-browser-move-up-level
<tab>                      emms-browser-next-non-track
*** playlist
~+~                         emms-volume-raise
~-~                         emms-volume-lower
/ /                       emms-playlist-limit-to-all
/ a                       emms-playlist-limit-to-info-artist
/ b                       emms-playlist-limit-to-info-album
/ c                       emms-playlist-limit-to-info-composer
/ d                       emms-playlist-limit-to-description
/ g                       emms-playlist-limit-to-info-genre
/ n                       emms-playlist-limit-to-name
/ p                       emms-playlist-limit-to-info-performer
/ t                       emms-playlist-limit-to-info-title
/ y                       emms-playlist-limit-to-info-year
<                         emms-seek-backward
<emacs-state> M-SPC m i   emms-insert-file
<emacs-state> M-SPC m l   emms-toggle-repeat-playlist
<emacs-state> M-SPC m m   emms-shuffle
<emacs-state> M-SPC m p   emms-insert-playlist
<emacs-state> M-SPC m s   emms-playlist-save
<emacs-state> M-SPC m t   emms-toggle-repeat-track
<insert-state> M-SPC m i  emms-insert-file
<insert-state> M-SPC m l  emms-toggle-repeat-playlist
<insert-state> M-SPC m m  emms-shuffle
<insert-state> M-SPC m p  emms-insert-playlist
<insert-state> M-SPC m s  emms-playlist-save
<insert-state> M-SPC m t  emms-toggle-repeat-track
<motion-state> SPC m i    emms-insert-file
<motion-state> SPC m l    emms-toggle-repeat-playlist
<motion-state> SPC m m    emms-shuffle
<motion-state> SPC m p    emms-insert-playlist
<motion-state> SPC m s    emms-playlist-save
<motion-state> SPC m t    emms-toggle-repeat-track
<mouse-2>                 emms-playlist-mode-play-current-track
<normal-state> +          emms-volume-raise
<normal-state> -          emms-volume-lower
<normal-state> .          emms-playlist-mode-center-current
<normal-state> <          emms-seek-backward
<normal-state> =          emms-volume-raise
<normal-state> >          emms-seek-forward
<normal-state> C          emms-playlist-clear
<normal-state> C-j        emms-next
<normal-state> C-k        emms-previous
<normal-state> D          emms-playlist-mode-kill-track
<normal-state> G          emms-playlist-mode-last
<normal-state> M-y        emms-playlist-mode-yank-pop
<normal-state> O          evil-collection-emms-playlist-mode-insert-newline-above
<normal-state> P          evil-collection-emms-playlist-mode-paste-before
<normal-state> R          emms-tag-editor-rename
<normal-state> RET        emms-playlist-mode-play-smart
<normal-state> S          nil
<normal-state> SPC m i    emms-insert-file
<normal-state> SPC m l    emms-toggle-repeat-playlist
<normal-state> SPC m m    emms-shuffle
<normal-state> SPC m p    emms-insert-playlist
<normal-state> SPC m s    emms-playlist-save
<normal-state> SPC m t    emms-toggle-repeat-track
<normal-state> X          emms-stop
<normal-state> [ [        emms-playlist-mode-previous
<normal-state> ] ]        emms-playlist-mode-next
<normal-state> a          emms-playlist-mode-add-contents
<normal-state> d          emms-playlist-mode-goto-dired-at-point
<normal-state> g d        emms-playlist-mode-goto-dired-at-point
<normal-state> g g        emms-playlist-mode-first
<normal-state> g j        emms-next
<normal-state> g k        emms-previous
<normal-state> o          evil-collection-emms-playlist-mode-insert-newline-below
<normal-state> p          evil-collection-emms-playlist-mode-paste-after
<normal-state> r          emms-random
<normal-state> s          nil
<normal-state> u          emms-playlist-mode-undo
<normal-state> x          emms-pause
<normal-state> z e        emms-tag-editor-edit
<normal-state> z p        emms-playlist-set-playlist-buffer
<normal-state> z s        emms-show
<visual-state> D          emms-playlist-mode-kill
<visual-state> SPC m i    emms-insert-file
<visual-state> SPC m l    emms-toggle-repeat-playlist
<visual-state> SPC m m    emms-shuffle
<visual-state> SPC m p    emms-insert-playlist
<visual-state> SPC m s    emms-playlist-save
<visual-state> SPC m t    emms-toggle-repeat-track
>                         emms-seek-forward
?                         describe-mode
C                         emms-playlist-clear
C-/                       emms-playlist-mode-undo
C-M-i                     ispell-complete-word
C-_                       emms-playlist-mode-undo
C-j                       emms-playlist-mode-insert-newline
C-k                       emms-playlist-mode-kill-track
C-n                       next-line
C-p                       previous-line
C-w                       emms-playlist-mode-kill
C-x C-s                   emms-playlist-save
C-x u                     emms-playlist-mode-undo
C-y                       emms-playlist-mode-yank
D                         emms-playlist-mode-kill-track
E                         emms-tag-editor-edit
K                         emms-playlist-mode-current-kill
M-<                       emms-playlist-mode-first
M->                       emms-playlist-mode-last
M-n                       emms-playlist-mode-next
M-p                       emms-playlist-mode-previous
M-y                       emms-playlist-mode-yank-pop
P                         emms-pause
R                         emms-tag-editor-rename
RET                       emms-playlist-mode-play-smart
S C                       emms-playlist-sort-by-info-composer
S L                       emms-playlist-sort-by-list
S N                       emms-playlist-sort-by-name
S T                       emms-playlist-sort-by-file-mtime
S a                       emms-playlist-sort-by-info-artist
S b                       emms-playlist-sort-by-info-album
S c                       emms-playlist-sort-by-play-count
S e                       emms-playlist-sort-by-file-extension
S l                       emms-playlist-sort-by-last-played
S n                       emms-playlist-sort-by-natural-order
S o                       emms-playlist-sort-by-info-note
S p                       emms-playlist-sort-by-info-performer
S t                       emms-playlist-sort-by-info-title
S y                       emms-playlist-sort-by-info-year
SPC                       scroll-up
a                         emms-playlist-mode-add-contents
b                         emms-playlist-set-playlist-buffer
c                         emms-playlist-mode-center-current
d                         emms-playlist-mode-goto-dired-at-point
f                         emms-show
n                         emms-next
p                         emms-previous
q                         #<anonymous-function>
r                         emms-random
s                         emms-stop
* Inactive
** Mastodon                                    :NOT_IN_USE:
#+begin_src emacs-lisp
;; mastodon config
;;(setq mastodon-instance-url "https://mathstodon.xyz" mastodon-active-user "thain")
#+end_src
** Vterm
#+begin_src emacs-lisp
;; vterm config
;; (after! vterm
;;   (setq vterm-shell "/usr/bin/fish"
;;         vterm-ignore-blink-cursor nil))
#+end_src
