doom/conf.el

;; mastodon config
;;(setq mastodon-instance-url "https://mathstodon.xyz" mastodon-active-user "thain")

;; vterm config
;; (after! vterm
;;   (setq vterm-shell "/usr/bin/fish"
;;         vterm-ignore-blink-cursor nil))
